// Напишіть функцію для охоронця нічного клубу яка приймає два параметри age та balance.
// Функція повинна повернути рядок "Wellcome" якщо age більший за 18 та balance більший за 100. 
// В іншому випадку функцію повинна повернути рядок "Goodbye".

// function security(age, balance) {
//     if (age > 18 && balance > 100) {
//         return "Wellcome";
//     } else {
//         return "Goodbye";
//     }
// }
// console.log(security(19, 101));
//==============================================================================================================================================
// Напишіть функцію яка для магазину яка приймає кількість товару(amount) та його вартість(price). 
// Функція повинна повернути рядок "Ми це купуємо" якщо загальна вартість не перевищує 1000, в іншому випадку функція повинна повернути рядок "Це занадто дорого".

// function shop(amount, price) {
//     const totalPrice = amount * price;
//     if (totalPrice <= 1000) {
//         return "Ми це купуємо"
//     } else {
//         return "Це занадто дорого"
//     }
// }
// console.log(shop(10, 100));
//==============================================================================================================================================
// Напишіть функцію, яка приймає температуру(temp) в градусах Цельсія. 
// Якщо температура нижче 0, функція повинна повернути рядок "Замерзає", якщо більше 0 але менше 25 - "Нормальна температура", якщо більше 25 - "Спекотно".

// function couldly(temp) {
//     if (temp < 0) {
//         return "Замерзає"
//     } else if (0 <= temp && temp < 25) {
//         return "Нормальна температура";
//     } else {
//         return "Спекотно";
//     }
// }
// console.log(couldly(-1));
//==============================================================================================================================================
// Напишіть функцію, яка приймає 2 числа: number та divisor. 
// Якщо number ділиться на divisor без остатку, поверніть рядок "Ділиться", в іншому випадку поверніть "Не ділиться".

// function share(number, divisor) {
//     const result = number & divisor;
//     if (result === 0) {
//         return "Ділиться";
//     } else {
//         return "Не ділиться"
//     }
// }
// console.log(share(100, 10));
//==============================================================================================================================================
Задача-5











//==============================================================================================================================================















//==============================================================================================================================================

















//==============================================================================================================================================
















//==============================================================================================================================================


















//==============================================================================================================================================





















//==============================================================================================================================================




















//==============================================================================================================================================