
//=============== ЗМІНІ ===============

//Створи дві змінні firstName і lastName. Присвой їм своє ім'я та прізвище.
//Обєднай ці два рядки в один, з пробілом між ними. Запиши результат в змінну fullName.

// const firstName = 'Mazun';
// const lastName = 'Volodymyr';
// const fullName = firstName + ' ' + lastName;
// console.log(fullName);
//==============================================================================================================================================
// Створи дві змінні a і b, присвой їм якісь цілі числа. Виконай над ними додавання, віднімання, множення і ділення.
// Запиши результати в змінні sum, difference, product, quotient.

// const a = 50;
// const b = 25;
// const sum = a + b;
// const difference = a - b;
// const product = a * b;
// const quotient = a / b;
// console.log(sum, difference, product, quotient);
//==============================================================================================================================================
// Створи змінну radius і присвой їй деяке значення (наприклад, 5).
// Використай формулу площі кола (π * r²) для обчислення площі кола з радіусом, який було встановлено.
// Використовуй значення π = 3.14. Запиши результат у змінну area.

// const radius = 3;
// const area = 3.14 * (radius ** 2);
// console.log(area + ' mm');
//==============================================================================================================================================
// Створи змінну someString і присвой їй будь-який рядок.
// Обчисли довжину цього рядка, використовуючи властивість .length.

// const someString = 'I live in Ukraine!';
// const strLength = someString.length;
// console.log(strLength);
//==============================================================================================================================================
// Створи змінну someString і присвой їй будь-який рядок.
// Створи змінну firstLetter і присвой їй першу літеру рядка someString.
// Створи змінну lastLetter і присвой їй останню літеру рядка someString.

// const someString = 'I go to school!';
// const firstLetter = someString[0];
// const lastLetter = someString[someString.length - 1];
// console.log(firstLetter, lastLetter);
//==============================================================================================================================================
// Створи дві змінних str1 та str2. Отримай з кожної змінної останню літеру
// Створи третю змінну де обєднай попередні літери

// const str1 = 'HellO';
// const str2 = 'WorlD';
// const str1LastLetter = str1[str1.length - 1];
// const str2LastLetter = str2[str2.length - 1];
// const str3 = str1LastLetter + str2LastLetter;
// console.log(str3);
//==============================================================================================================================================
// Створи змінну userValue та запиши до неї будь-яке число.
// Створи нову змінну до якої потрібно записати результат математичної операції а саме:
// userValue помножити на число 5 у степені (кількість цифр у змінній userValue).

// const userValue = 11;
// const userValue1 = userValue * (5 ** 2);
// console.log(userValue1);
//==============================================================================================================================================
// Замінити вираз перевизначення комбінованим оператором `+=`.

// let students = 100;
// students += 50;
// console.log(students);
//==============================================================================================================================================
// Склади фразу за допомогою шаблонних рядків `A has B bots in stock`, де A, B - змінні вставлені у рядок.

// const companyName = "Cyberdyne Systems";
// const repairBots = 150;
// const defenceBots = 50;
// const message = companyName + `has ${repairBots} bots in stock ${defenceBots}`;
// console.log(message);
//==============================================================================================================================================