
//=============== МАСИВИ ТА МЕТОДИ РЯДОЧКІВ ===============
// Напиши цикл, який виведе на консоль числа від 1 до 10.
// const array =[];
// for(let i = 0; i <= 10; i++) {
//     array.push(i);
// }
// console.log(array);
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// const array = [];
// for(let i = 0; i <= 20; i += 2) {
//     array.push(i)
// }
// console.log(array);
//==============================================================================================================================================
// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// let summy = 0;
// for (let i = 0; i <= 100; i++) {
//     summy += i;
// }
// console.log(summy);
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

// for (let i = 0; i <= 10; i++) {
//     console.log(`${i} * 7 = ${i * 7}`);
    
// }
//==============================================================================================================================================
// Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
// const array = "Hello world";

// const array = "Hello world";
// const newArray = [];
// for (let i = 0; i < array.length; i += 2) {
//     newArray.push(array[i])
// }
// console.log(newArray);
//==============================================================================================================================================
// Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому порядку.

// const array = "Hello world";
// const newArray = [];
// for (let i = array.length - 1; i > 0; i--) {
//     newArray.push(array[i]);
// }
// console.log(newArray);
//==============================================================================================================================================
// Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне пробіл.

// const array = "Hello workd";
// for (let i = 0; i < array.length; i++) {
//     if (array[i] === " ") {
//         break
//     }
//     console.log(array[i]);
// }
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// const array = "JavaScript";
// for (let i = 0; i < array.length; i += 2) {
//     console.log(array[i]);
    
// }
//==============================================================================================================================================
// // Напиши функцію, яка приймає рядок та повертає перевернутий рядок
// const str = "123456789";

// function createStr(str) {
//     let newStr = '';
//     for (let i = str.length - 1; i >= 0; i--) {
//         newStr += str[i];
//     }
//     return newStr;
// }
// console.log(createStr(str));
//==============================================================================================================================================
// Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у верхньому регістрі
// const str = 'hello world';

// function returnStr(str) {
//     let newStr = '';
//     for (let i = 0; i < str.length; i++) {
//         newStr += (str[i]).toUpperCase();
//     }
//     return newStr;
// }

// console.log(returnStr('hello world'));
//==============================================================================================================================================
// Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до рядочка str1 стільки разів скільки вказали у параметрі count.

// function getString(str1, str2, count) {
//     let result = str1;
//     for (let i = 0; i < count; i++) {
//         result += str2;
//     }
//     return result;
// }
// console.log(getString('Good Morning ', '!', 5));
//==============================================================================================================================================