
//=============== МАСИВИ ===============
// Напиши функцію, яка приймає масив та виводить кожен елемент масиву у консоль.

// function printArrayElements(arr) {
//     arr.forEach(element => {
//         console.log(element);
//     });
// }
//==============================================================================================================================================
// Напиши функцію, яка приймає масив та виводить кожен парний елемент масиву у консоль.

// function printEvenElements(arr) {
//     arr.forEach(element => {
//         if (element % 2 === 0) {
//         console.log(element);
//         }
//     });
// }
//==============================================================================================================================================
// Напиши функцію, яка приймає два параметри (arr, max). Де arr - це масив чисел. Потрібно вивести лише ті елементи масиву які більші за max.

// function printGreaterThanMax(arr, max) {
//     arr.forEach(element => {
//         if (element > max) {
//             console.log(element);
//         }
//     });
// }
//==============================================================================================================================================
// Напиши функцію яка приймає масив та повертає суму всіх чисел у масиві.

// function sumArray(arr) {
//     return arr.reduce((sum, currrent) => sum + currrent, 0)
// }
//==============================================================================================================================================
// Напиши функцію яка приймає масив та елемент для пошуку. Фукнція повинна порахувати скільки разів шуканий елемент зустрічається у масиві.

// function countOccurrences(arr, element) {
//     let count = 0;
//     arr.forEach(item => {
//         if (item === element) {
//             count++;
//         }
//     });
//     return count;
// }
//==============================================================================================================================================
// Напиши функцію яка приймає масив чисел. Функція повинна видалити усі негативні(відємні числа) з масиву та повернути новий масив.

// function removeNegatives(arr) {
//     return arr.filter(number => number >= 0);
// }
//==============================================================================================================================================
// Напиши функцію яка приймає масив рядочків. Потрібно змінити кожен елемент масиву наступним чином - якщо довжина рядочку менша за 6 до привести рядок до нижнього регістру, в іншому випадку привести до верхнього регістру.

// function modifyStrings(arr) {
//     return arr.map(str =>
//         str.length < 6 ? str.toLowerCase() : str.toUpperCase()
//     );
// }
//==============================================================================================================================================
// Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише непарні числа.

// function getOddNumbers(arr) {
//     return arr.filter(number => number % 2 !== 0);
// }
//==============================================================================================================================================
// Напиши функцію, яка приймає масив чисел і повертає новий масив, де кожне число помножене на індекс, за яким воно знаходиться в масиві.

// function multiplyByIndex(arr) {
//     return arr.map((number, index) => number * index);
// }
//==============================================================================================================================================
// Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише числа, які діляться на 3.

// function getDivisibleBy3(arr) {
//     return arr.filter(number => number % 3 === 0);
// }
//==============================================================================================================================================


//==============================================================================================================================================


//==============================================================================================================================================


//==============================================================================================================================================


//==============================================================================================================================================





// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише ті елементи які зустрічаються і в arr1 і arr2.
// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише елементи масиву arr1 яких не має у масиві arr2.
// Напиши функцію яка приймає масив та знаходить мінімальний елемент.
// Напиши функцію яка приймає масив та знаходить максимальний елемент.
// Напиши функцію яка приймає масив та повертає масив лише з тих елементів які більші за середнє значення всіх елементів масиву.
// Напиши функцію яка приймає масив та повертає масив лише з тих елементів які більші за власний індекс.
// Напишіть функці яка приймає масив чисел. Функція повинна занйти мінімальний елемент та видалити його з масиву.
// Напиши функцію яка приймає два параметри start та end.Функія повина повернути масив де будуть числа з діапазону але лише ті у яких не має цифри 5. К прикладу числа(51, 25, 15, 256) не підходять бо містять символ "5" у собі.


// Напиши функцію, яка приймає массив чисел і повертає новий масив, де всі парні числа переміщені в початок, а всі непарні - в кінець.
// Напиши функцію, яка приймає массив чисел і повертає новий массив, де кожен елемент є сумою усіх попередніх елементів.
// Напиши функцію, яка приймає массив чисел і повертає новий массив, що містить лише унікальні числа.
// Напиши функцію, яка приймає два масиви і повертає об'єднаний массив без дублювання елементів.
// Напиши функцію, яка приймає массив чисел і повертає новий массив, де кожен елемент є середньоарифметичним всіх сусідніх елементів.
// Напиши функцію, яка приймає массив чисел і повертає новий массив, де елементи відсортовані в порядку збільшення або зменшення.
// Напиши функцію, яка приймає массив рядочків та сортує їх за довжиною елементів.