
//=============== МАСИВИ ТА МЕТОДИ РЯДОЧКІВ ===============
// Напиши цикл, який виведе на консоль числа від 1 до 10.

// const array = [];
// for (let i = 0; i <= 10; i++) {
//     array.push(i);
// }
// console.log(array);
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// const array = [];
// for (let i = 0; i <= 20; i += 2) {
//     array.push(i);
// }
// console.log(array);
//==============================================================================================================================================
// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// let sum = 0;
// for (let i = 0; i <= 100; i++) {
//     sum += i;
// }
// console.log(sum);
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

// for (let i = 0; i <= 10; i++) {
//     console.log(`${[i]} * 7 = ${i * 7}`);
// }
//==============================================================================================================================================
// Напиши цикл, який обчислить факторіал числа, введеного користувачем (наприклад, факторіал числа 5: !5 = 1 * 2 * 3 * 4 * 5).





//==============================================================================================================================================
// Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
//==============================================================================================================================================
// Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому порядку.
//==============================================================================================================================================
// Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне пробіл.
//==============================================================================================================================================
// Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".
//==============================================================================================================================================
// Напиши функцію, яка приймає рядок та повертає перевернутий рядок
//==============================================================================================================================================
// Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у верхньому регістрі
//==============================================================================================================================================
// Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до рядочка str1 стільки разів скільки вказали у параметрі count.