
//=============== РОЗГАЛУЖЕННЯ ТА БУЛЕВІ ЗНАЧЕННЯ ===============

// Напишіть функцію для охоронця нічного клубу яка приймає два параметри age та balance.
// Функція повинна повернути рядок "Wellcome" якщо age більший за 18 та balance більший за 100. 
// В іншому випадку функцію повинна повернути рядок "Goodbye".

// function security(age, balance) {
//     if (age > 18 && balance > 100) {
//         return "Wellcome";
//     } else {
//         return "Goodbye";
//     }
// }
// console.log(security(19, 101));
//==============================================================================================================================================
// Напишіть функцію яка для магазину яка приймає кількість товару(amount) та його вартість(price). 
// Функція повинна повернути рядок "Ми це купуємо" якщо загальна вартість не перевищує 1000, в іншому випадку функція повинна повернути рядок "Це занадто дорого".

// function shop(amount, price) {
//     const totalPrice = amount * price;
//     if (totalPrice <= 1000) {
//         return "Ми це купуємо"
//     } else {
//         return "Це занадто дорого"
//     }
// }
// console.log(shop(10, 100));
//==============================================================================================================================================
// Напишіть функцію, яка приймає температуру(temp) в градусах Цельсія. 
// Якщо температура нижче 0, функція повинна повернути рядок "Замерзає", якщо більше 0 але менше 25 - "Нормальна температура", якщо більше 25 - "Спекотно".

// function couldly(temp) {
//     if (temp < 0) {
//         return "Замерзає"
//     } else if (0 <= temp && temp < 25) {
//         return "Нормальна температура";
//     } else {
//         return "Спекотно";
//     }
// }
// console.log(couldly(-1));
//==============================================================================================================================================
// Напишіть функцію, яка приймає 2 числа: number та divisor. 
// Якщо number ділиться на divisor без остатку, поверніть рядок "Ділиться", в іншому випадку поверніть "Не ділиться".

// function share(number, divisor) {
//     const result = number & divisor;
//     if (result === 0) {
//         return "Ділиться";
//     } else {
//         return "Не ділиться"
//     }
// }
// console.log(share(100, 10));
//==============================================================================================================================================
// Напишіть функцію, яка приймає 2 параметри: isRaining(булевий) і hasUmbrella(булевий). 
// Якщо дощить і у вас є парасоля, поверніть "Не змокнеш", якщо дощить і немає парасолі, поверніть "Змокнеш", в іншому випадку поверніть "Без дощу".

// function perevirkaRains(isRaining, hasUmbrella) {
//     const yesRaining = isRaining;    //true
//     const yesUmbrella = hasUmbrella; //true
//     if (yesRaining && yesUmbrella) {
//         return "Не змокнеш";
//     } else if (yesRaining || yesUmbrella) {
//         return "Змокнеш";
//     } else {
//         return "Без дощу";
//     }
// }
// console.log(perevirkaRains(true, true));
//==============================================================================================================================================
// Напишіть функцію, яка приймає оцінку студента(grade) за шкалою від 0 до 100. 
// Якщо оцінка 90 і більше, поверніть "Відмінно", від 75 до 89 - "Добре", від 50 до 74 - "Задовільно", нижче 50 - "Незадовільно".

// function  student(grade) {
//     if (grade >= 90) {
//         return "Відмінно";
//     } else if (grade >= 75 && grade <= 89) {
//         return "Добре";
//     } else if (grade >= 50 && grade <= 74) {
//         return "Задовільно";
//     } else {
//         return "Незадовільно"
//     }
// }
// console.log(student(90));
//==============================================================================================================================================
// Напишіть функцію, яка приймає два параметри: dayOfWeek та isHoliday. 
// Якщо dayOfWeek це "Saturday" або "Sunday" або isHoliday є true, поверніть "Вихідний", в іншому випадку поверніть "Робочий день".

// function  isDays(dayOfWeek, isHoliday) {
//     if (dayOfWeek === "Saturday" || dayOfWeek === "Sunday" || isHoliday) {
//         return "Вихідний";
//     } return "Робочий день";
// }
// console.log(isDays("Saturday", true));
//==============================================================================================================================================
Задача-9
Напишіть функцію, яка приймає два параметри: hasInvitation(булевий) і isFriend(булевий). 
Якщо у вас є запрошення або ви друг, поверніть "Ви запрошені", в іншому випадку поверніть "Вхід заборонено".
















//==============================================================================================================================================
















//==============================================================================================================================================


















//==============================================================================================================================================





















//==============================================================================================================================================




















//==============================================================================================================================================